tap "asappinc/tap", "git@github.asapp.dev:ASAPPinc/homebrew-tap.git"
tap "dotenvx/brew"
tap "hashicorp/tap"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Dynamic version generation
brew "dunamai"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Go tool to modify struct field tags
brew "gomodifytags"
# Command-line Golang template processor
brew "gomplate"
# Language server for the Go language
brew "gopls"
# Automatically generate Go test boilerplate from your source code
brew "gotests"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Make JSON greppable
brew "gron"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Colorize your kubectl output
brew "kubecolor"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Run LogQL queries against a Loki server
brew "logcli"
# Powerful paging program
brew "most"
# Manage multiple Node.js versions
brew "nvm"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Development kit for the Java programming language
brew "openjdk"
# Shell command parallelization utility
brew "parallel"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Object-relational database system
# brew "postgresql@18"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Pluggable linter and fixer to enforce Protocol Buffer style and conventions
brew "protolint"
# Password generator
brew "pwgen"
# Software environment for statistical computing
# brew "r"
# Persistent key-value database, with built-in net interface
# brew "redis", restart_service: :changed
# Extremely fast Python linter, written in Rust
brew "ruff"
# Autoformat shell script source code
brew "shfmt"
# SQL formatter with width-aware output
brew "sqlfmt"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Flexible, reusable and concise configuration for Kubernetes using Jsonnet
brew "tanka"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
brew "asappinc/tap/atk"
# Secure dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# Vault
brew "hashicorp/tap/vault"
# Password manager that keeps all passwords secure behind one password
#cask "1password"
# Command-line interface for 1Password
#cask "1password-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GUI for vim, made for macOS
cask "macvim"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"

# Fonts
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-powerline-symbols"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"

cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-liberation-nerd-font"

#vscode "aaron-bond.better-comments"
#vscode "adamhartford.vscode-base64"
#vscode "anthropic.claude-code"
#vscode "atlassian.atlascode"
#vscode "bierner.github-markdown-preview"
#vscode "bierner.markdown-checkbox"
#vscode "bierner.markdown-emoji"
#vscode "bierner.markdown-footnotes"
#vscode "bierner.markdown-mermaid"
#vscode "bierner.markdown-preview-github-styles"
#vscode "bierner.markdown-yaml-preamble"
#vscode "brunoventura.sqltools-athena-driver"
#vscode "charliermarsh.ruff"
#vscode "dbaeumer.vscode-eslint"
#vscode "docker.docker"
#vscode "github.copilot"
#vscode "github.copilot-chat"
#vscode "github.vscode-pull-request-github"
#vscode "golang.go"
#vscode "grafana.vscode-jsonnet"
#vscode "hashicorp.hcl"
#vscode "hashicorp.terraform"
#vscode "hbenl.vscode-test-explorer"
#vscode "ibm.output-colorizer"
#vscode "littlefoxteam.vscode-python-test-adapter"
#vscode "mechatroner.rainbow-csv"
#vscode "ms-azuretools.vscode-containers"
#vscode "ms-azuretools.vscode-docker"
#vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
#vscode "ms-python.debugpy"
#vscode "ms-python.python"
#vscode "ms-python.vscode-pylance"
#vscode "ms-python.vscode-python-envs"
#vscode "ms-vscode-remote.remote-containers"
#vscode "ms-vscode.test-adapter-converter"
#vscode "mtxr.sqltools"
#vscode "pomdtr.excalidraw-editor"
#vscode "randomfractalsinc.vscode-data-preview"
#vscode "redhat.vscode-yaml"
#vscode "samuelcolvin.jinjahtml"
#vscode "svelte.svelte-vscode"
#vscode "tamasfe.even-better-toml"
#vscode "yo1dog.cursor-align"
#vscode "yzhang.markdown-all-in-one"
#vscode "zeshuaro.vscode-python-poetry"
